Revit 2024 API
RebarBendingDetailType.BendDiameterDimensionType Property
 Identifies what type of bend diameter dimensions will be shown (radial or diameter).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public BendingDetailBendDiameterDimensionType BendDiameterDimensionType { get; set; }
Visual Basic
Public Property BendDiameterDimensionType As BendingDetailBendDiameterDimensionType
	Get
	Set
Visual C++
public:
property BendingDetailBendDiameterDimensionType BendDiameterDimensionType {
	BendingDetailBendDiameterDimensionType get ();
	void set (BendingDetailBendDiameterDimensionType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace